app/Controllers/Dashboard.php

SELECT *
FROM `setoran`
WHERE `tanggal` = '2022-11-01'
---
    public function index()
    {
        $tanggal = date('Y-m-d');
        $bulan = date('Y-m');
        $data['mitra'] = $this->model->hitung();

        $data['setoran'] = $this->setoran->hitungsetoran();

        $today = $this->setoran->where('tanggal', $tanggal)->get();
        $data['today'] = $today->getNumRows();

        $month = $this->setoran->like('tanggal', $bulan)->get();