app/Controllers/KoranWeb.php

    public function index()
    {
        $data['mitra'] = $this->model->orderBy('id_koran', 'desc')->findAll();
---
SELECT *
FROM `koran`
ORDER BY `id_koran` DESC

    public function update($id)
    {
        $data['koran'] = $this->request->getPost('nama_mitra');

        $data['id_koran'] = $id;
        // dd($data);
        $isExist = $this->model->where('id_koran', $id)->findAll();
        if ($isExist) {
            if (!$this->model->save($data)) return $this->fail($this->model->errors());
---
UPDATE `koran` SET `koran` = 'Banjarmasin Post', `updated_at` = '2022-10-05 17:34:21'
WHERE `koran`.`id_koran` IN ('24')

    public function delete($id)
    {
        $data = $this->model->where('id_koran', $id)->findAll();
        if (!$data) {
            session()->setFlashData('error', 'ID tidak ditemukan');
        }

        $this->model->delete($id);
---
SELECT *
FROM `koran`
WHERE `id_koran` = '19'
DELETE FROM `koran`
WHERE `id_koran` IN ('19')