app/Controllers/Koran.php

SELECT *
FROM `koran`
ORDER BY `id_koran` DESC
---
    public function index()
    {
        $data = $this->model->orderBy('id_koran', 'desc')->findAll();

SELECT *
FROM `koran`
WHERE `koran`.`id_koran` = '17'
---
    public function delete($id = null)
    {
        $data = $this->model->where('id_koran', $id)->findAll();