app/Controllers/Laporan.php

SELECT *
FROM `setoran`
WHERE `tanggal` BETWEEN "2022-10-01" and "2022-10-31"
SELECT *
FROM `setoran`
WHERE `tanggal` BETWEEN "2022-10-01" and "2022-10-31"&& `nama_koran` LIKE "Banjarmasin Post"
---
    public function setoranExcel()
    {
        $start_date = $this->request->getPost('dari');
        $end_date = $this->request->getPost('sampai');

        $dataKoran = $this->setoran->where('tanggal BETWEEN "' . date('Y-m-d', strtotime($start_date)) . '" and "' . date('Y-m-d', strtotime($end_date)) . '"')->findAll();

        $arr = [];
        $tot = [];
        $jum = 0;

        $getAllMitra = $this->model->findAll();

        foreach ($getAllMitra as $key) {
            array_push($arr, $key['koran']);
        }

        for ($i = 0; $i < sizeof($arr); $i++) {
            $jum = $jum - $jum;
            $getSet = $this->setoran->where('tanggal BETWEEN "' . date('Y-m-d', strtotime($start_date)) . '" and "' . date('Y-m-d', strtotime($end_date)) . '"&& nama_koran LIKE "' . $arr[$i] . '"')->findAll();