app/Controllers/SetoranWeb.php

SELECT *
FROM `koran`
SELECT *
FROM `setoran`
ORDER BY `tanggal` DESC
---
    public function index()
    {
        $data['koran']      = $this->modelKoran->findAll();
        $data['setoran']    = $this->model->orderBy('tanggal', 'desc')->findAll();