app/Controllers/UserWeb.php

    public function index()
    {
        $data['user'] = $this->model->orderBy('id', 'desc')->findAll();
---
SELECT *
FROM `user`
ORDER BY `id` DESC