app/Models/ModelUser.php

    public function hitungUser()
    {
        $query = $this->get();
---
SELECT *
FROM `user`