app/Models/ModelSetoran.php

SELECT *
FROM `setoran`
---
    public function hitungsetoran()
    {
        $query = $this->get();