app/Models/ModelKoran.php

SELECT *
FROM `koran`
---
    public function hitung()
    {
        $query = $this->get();